from dotenv import load_dotenv  # Загружает переменные из .env файла
import os  


def get_weather_api_key():
    load_dotenv(override=True)  # Загружает .env, перезаписывая существующие переменные
    return os.getenv("WEATHER_API_KEY", "")  # Возвращает API-ключ или пустую строку


def get_city():
    load_dotenv(override=True)
    return os.getenv("CITY", "Saint Petersburg")  # Возвращает город или Санкт-Петербург по умолчанию


WEATHER_MESSAGES = {  # Словарь с шаблонами сообщений для разных типов погоды
        "Clear": [  # Сообщения для ясной погоды
            "Солнце! Бери темные очки.",
            "Кайфовая погода, рекомендую погулять.",
            "На улице ясно. Отличный день!",
            "Небо чистое. Наслаждайся теплом."
        ],

        "Clouds": [  # Для облачной погоды
            "Облачно, но без осадков. Комфортно.",
            "Солнце спряталось. Идеально для прогулки.",
            "Не жарко. Самое то побегать.",
            "Пасмурно, но день будет супер!"
        ],

        "Rain": [  # Для дождливой погоды
            "Дождик! Твой зонт заждался.",
            "Капает. Обувай непромокаемые кеды.",
            "Свежесть после дождя — кайф.",
            "Дождь не помеха хорошему дню!"
        ],

        "Snow": [  # Для снежной погоды
            "Красота! Снаружи сказочный снегопад.",
            "Снег валит. Утепляйся по полной!",
            "Время лепить снеговика. Одевайся теплее.",
            "Свежий снег. На улице супер!"
        ],

        "Thunderstorm": [  # Для грозы
            "Гроза! Уютно чиллим дома.",
            "Гремит. Отличный повод для сериала.",
            "Молнии! Пережди этот замес в тепле.",
            "Штормит. Дома теплее и безопаснее."
        ],

        "Mist": [  # Для легкого тумана
            "Туман. На улице Silent Hill.",
            "Вокруг молоко. Будь аккуратнее на дороге.",
            "Загадочный туман.",
            "Видимость слабая, зато очень атмосферно."
        ],

        "Fog": [  # Для сильного тумана
            "Туман. На улице Silent Hill.",
            "Вокруг молоко. Будь аккуратнее на дороге.",
            "Загадочный туман.",
            "Видимость слабая, зато очень атмосферно."
        ]
    }
